Autodesk.Navisworks.Api.SearchLocations
Which items within a Autodesk.Navisworks.Api.Search Selection should be searched

Autodesk.Navisworks.Api.SearchLocations.None
No items

Autodesk.Navisworks.Api.SearchLocations.Self
Direct contents of the selection

Autodesk.Navisworks.Api.SearchLocations.Descendants
Descendants of the items in the selection

Autodesk.Navisworks.Api.SearchLocations.DescendantsAndSelf
Direct contents of the selection and their descendants